In [1]:
# package import
#%%
import pandas as pd
import altair as alt
import numpy as np

# data import
dat = pd.read_csv("https://raw.githubusercontent.com/byuidatascience/data4names/master/data-raw/names_year/names_year.csv")
col_list = dat.columns

In [2]:
col_list

Index(['name', 'year', 'AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE',
       'FL', 'GA', 'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD',
       'ME', 'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT',
       'VA', 'VT', 'WA', 'WI', 'WV', 'WY', 'Total'],
      dtype='object')

In [3]:
import pandas as pd
import altair as alt
import numpy as np
# data import
url = "https://raw.githubusercontent.com/byuidatascience/data4names/master/data-raw/names_year/names_year.csv"
names = pd.read_csv(url)

In [4]:
names.head()

,name,year,AK,AL,AR,AZ,CA,CO,CT,DC,...,TN,TX,UT,VA,VT,WA,WI,WV,WY,Total
0,Aaden,2005,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,5.0
1,Aaden,2007,0.0,5.0,0.0,5.0,20.0,6.0,0.0,0.0,...,5.0,14.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,98.0
2,Aaden,2008,0.0,15.0,13.0,20.0,135.0,10.0,9.0,0.0,...,15.0,99.0,8.0,26.0,0.0,11.0,19.0,5.0,0.0,939.0
3,Aaden,2009,0.0,28.0,20.0,23.0,158.0,22.0,12.0,0.0,...,33.0,140.0,6.0,17.0,0.0,31.0,23.0,14.0,0.0,1242.0
4,Aaden,2010,0.0,8.0,6.0,12.0,62.0,9.0,5.0,0.0,...,9.0,56.0,0.0,11.0,0.0,7.0,12.0,0.0,0.0,414.0

In [5]:
names.year = pd.to_datetime(names.year, format='%Y')

In [6]:
names.year

0        2005-01-01
1        2007-01-01
2        2008-01-01
3        2009-01-01
4        2010-01-01
            ...
393379   2011-01-01
393380   2012-01-01
393381   2013-01-01
393382   2014-01-01
393383   2015-01-01
Name: year, Length: 393384, dtype: datetime64[ns]